STMicroelectronics/STM32DDRFW-UTIL/Drivers/STM32MP2xx_HAL_Driver/Src/stm32mp2xx_hal_rcc_ex_valid.c
      /* Wait till PLL is ready */
      while (__HAL_RCC_GET_FLAG(RCC_FLAG_PLL4RDY) != RESET)
      {
        if ((int32_t)(HAL_GetTick() - tickstart) > PLL_TIMEOUT_VALUE)
        {
          return HAL_TIMEOUT;
        }
      }
    }
  }
#endif
  return HAL_OK;
}
#endif

#if 0 // FCh: Obsolete. Replace by HAL_RCC_EnableCSS()
/**
  * @brief  Enables the LSE Clock Security System.
  * @note   After reset BDCR register is write-protected and the DBP bit in the
  *         PWR control register 1 (PWR_CR1) has to be set before it can be written.
  * @note   Prior to enable the LSE Clock Security System, LSE oscillator is to be enabled
  *         with HAL_RCC_OscConfig() and the LSE oscillator clock is to be selected as RTC
  *         clock with HAL_RCCEx_PeriphCLKConfig().
  * @retval None
  */
void HAL_RCCEx_EnableLSECSS(void)
{
#if O_CODE
  /* Set LSECSSON bit */
  SET_BIT(RCC->BDCR, RCC_BDCR_LSECSSON);
#endif
}
#endif

#if 0 // FCh: Obsolete. LSECSS can't be disabled by SW.
/**
  * @brief  Disables the LSE Clock Security System.
  * @note   LSE Clock Security System can only be disabled after a LSE failure detection.
  * @note   After reset BDCR register is write-protected and the DBP bit in the
  *         PWR control register 1 (PWR_CR1) has to be set before it can be written.
  * @retval None
  */
void HAL_RCCEx_DisableLSECSS(void)
{
#if O_CODE
  /* Unset LSECSSON bit */
  CLEAR_BIT(RCC->BDCR, RCC_BDCR_LSECSSON);
#endif
}
#endif

/* FCh: Obsolete function. LSE drive is done part during HAL_RCC_SetOscCfg() call */
#if 0
HAL_StatusTypeDef RCC_LSEDriveConfig(uint32_t LseDriveValue)
{
#if O_CODE
  uint32_t count = 0;
  HAL_StatusTypeDef result = HAL_OK;

  /* Check the LSEDrive parameter */
  assert_param(IS_RCC_LSEDRIVE(LseDriveValue));

#define LSEDRIVE_PRE_NUM 4   //Number of possible LSE driving capabilities
  const uint32_t  LSEDRIVE_PRE[LSEDRIVE_PRE_NUM] = {RCC_LSEDRIVE_LOW, RCC_LSEDRIVE_MEDIUMLOW, RCC_LSEDRIVE_MEDIUMHIGH, RCC_LSEDRIVE_HIGH};

  /* Modify the LSE Driving capability if needed */
  if (LseDriveValue != __HAL_RCC_GET_LSEDRIVE())
  {
    switch (__HAL_RCC_GET_LSEDRIVE())
    {
      case RCC_LSEDRIVE_LOW:
        count = 0;
        break;

      case RCC_LSEDRIVE_MEDIUMLOW:
        count = 1;
        break;

      case RCC_LSEDRIVE_MEDIUMHIGH:
        count = 2;
        break;

      case RCC_LSEDRIVE_HIGH:
        count = 3;
        break;
    }

    /* Enable write access to Backup domain */
    SET_BIT(PWR->CR1, PWR_CR1_DBP);
    /* @TODO: Analyze if using HAL_PWR_EnableBkUpAccess instead */
    //HAL_PWR_EnableBkUpAccess();

    if (__HAL_RCC_GET_LSEDRIVE() < LseDriveValue)  // LSEDRIVE in device is smaller than desired
    {
      while ((count < LSEDRIVE_PRE_NUM) && (__HAL_RCC_GET_LSEDRIVE() != LseDriveValue))
      {
        count++;
        __HAL_RCC_LSEDRIVE_CONFIG(LSEDRIVE_PRE[count]);
        /* @TODO: Use 7 NOPs here not 1ms  */
        HAL_Delay(1);
      }
    }
    else
    {
      while ((count > 0) && (__HAL_RCC_GET_LSEDRIVE() != LseDriveValue))
      {
        count--;
        __HAL_RCC_LSEDRIVE_CONFIG(LSEDRIVE_PRE[count]);
        /* @TODO: Use 7 NOPs here not 1ms  */
        HAL_Delay(1);
      }
    }
  }//LSE Driving capability modified

  if (LseDriveValue != __HAL_RCC_GET_LSEDRIVE())
  {
    result = HAL_ERROR;
  }

  return result;
#endif
  return 0;
}
#endif

#ifdef CORE_CA35
/**
  * @brief  Control the enable boot function when the system exits from STANDBY
  * @param  RCC_BootCx: Boot Core to be enabled (set to 1)
  *         This parameter can be one (or both) of the following values:
  *            @arg RCC_BOOT_C1: CA35 core selection
  *            @arg RCC_BOOT_C2: CM33 core selection
  *
  * @note   Next combinations are possible:
  *           RCC_BOOT_C1   RCC_BOOT_C2  Expected result
  *               0              0       MPU boots, MCU does not boot
  *               0              1       Only MCU boots
  *               1              0       Only MPU boots
  *               1              1       MPU and MCU boot
  *
  * @note   This function is reset when a system reset occurs, but not when the
  *         circuit exits from STANDBY (rst_app reset)
  * @note   This function can only be called by the CA35
  * @retval None
  */
void HAL_RCCEx_EnableBootCore(uint32_t RCC_BootCx)
{
  assert_param(IS_RCC_BOOT_CORE(RCC_BootCx));
  SET_BIT(RCC->STBYBOOTCR, RCC_BootCx);
}

/**
  * @brief  Control the disable boot function when the system exits from STANDBY
  * @param  RCC_BootCx: Boot Core to be disabled (set to 0)
  *         This parameter can be one (or both) of the following values:
  *            @arg RCC_BOOT_C1: CA35 core selection
  *            @arg RCC_BOOT_C2: CM33 core selection
  *
  * @note   Next combinations are possible:
  *           RCC_BOOT_C1   RCC_BOOT_C2  Expected result
  *               0              0       MPU boots, MCU does not boot
  *               0              1       Only MCU boots
  *               1              0       Only MPU boots
  *               1              1       MPU and MCU boot
  *
  * @note   This function is reset when a system reset occurs, but not when the
  *         circuit exits from STANDBY (rst_app reset)
  * @note   This function can only be called by the CA35
  * @retval None
  */
void HAL_RCCEx_DisableBootCore(uint32_t RCC_BootCx)
{
  assert_param(IS_RCC_BOOT_CORE(RCC_BootCx));
  CLEAR_BIT(RCC->STBYBOOTCR, RCC_BootCx);
}

/**
  * @brief  The MCU will be set in HOLD_BOOT when the next MCU core reset occurs
  * @retval None
  */
void HAL_RCCEx_HoldBootMCU(void)
{
  CLEAR_BIT(RCC->CPUBOOTCR, RCC_CPUBOOTCR_BOOT_CPU2);
}

/**
  * @brief  The MCU will not be in HOLD_BOOT mode when the next MCU core reset occurs.
  * @note   If the MCU was in HOLD_BOOT it will cause the MCU to boot.
  * @retval None
  */
void HAL_RCCEx_BootMCU(void)
{
  SET_BIT(RCC->CPUBOOTCR, RCC_CPUBOOTCR_BOOT_CPU2);
}

#endif /* CORE_CA35 */

/**
  * @}
  */

/**
  * @}
  */

#endif /* HAL_RCC_MODULE_ENABLED */
/**
  * @}
  */

/**
  * @}
  */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/

